from pyheatmap.heatmap import HeatMap
data = []

# 定义坐标和热力值，十个热力点
sdata = ['381,54,23', '390,54,23', '400, 54, 23', '410, 54, 23', '410, 64, 23', '410, 74, 23', '410, 84, 23',
         '410, 94, 23', '410, 104, 23', '410, 114, 23', '410, 124, 23', '405, 134, 23', '403, 144, 23', '400, 150, 23'
         '405, 155, 15', '415, 165, 15', '425, 175, 15', '435, 185, 15']
# 这段实际上是 将定义的坐标值转化为 函数接收的形式，[[x,y,n],[x,y,n]]
for ln in sdata:
    a = ln.split(",")
    if len(a) != 3:
        continue
    a = [int(i) for i in a]
    data.append(a)

# 实例化热力图对象，传入坐标点 和背景图
hm = HeatMap(data, base='map1.png')
# 绘制热力图，并且保存
hm.heatmap(save_as="map2.png", r=8)
